import React from 'react';
import Table from '../components/Table';

function createData(onvan, namayande, semateNamayande, zamineFaaliat, dasteBandy) {
  return {
    onvan,
    namayande,
    semateNamayande,
    zamineFaaliat,
    dasteBandy
  };
}

const getData = () => [
  createData('شرکت اکسیژن هرمزگان', 'قنبر', 'مدیر فروش', 'تامین کننده گازهای طبی', 'شرکت ها'),
  createData('بخش icu', 'ام کلثوم', 'مسوول بخش', '', 'درون سازمانی'),
  createData('شرکت اکسیژن هرمزگان', 'قنبر', 'مدیر فروش', 'تامین کننده گازهای طبی', 'شرکت ها'),
  createData('بخش icu', 'ام کلثوم', 'مسوول بخش', '', 'درون سازمانی'),
  createData('شرکت اکسیژن هرمزگان', 'قنبر', 'مدیر فروش', 'تامین کننده گازهای طبی', 'شرکت ها'),
  createData('بخش icu', 'ام کلثوم', 'مسوول بخش', '', 'درون سازمانی'),
  createData('شرکت اکسیژن هرمزگان', 'قنبر', 'مدیر فروش', 'تامین کننده گازهای طبی', 'شرکت ها'),
  createData('بخش icu', 'ام کلثوم', 'مسوول بخش', '', 'درون سازمانی'),
  createData('شرکت اکسیژن هرمزگان', 'قنبر', 'مدیر فروش', 'تامین کننده گازهای طبی', 'شرکت ها'),
  createData('بخش icu', 'ام کلثوم', 'مسوول بخش', '', 'درون سازمانی'),
  createData('شرکت اکسیژن هرمزگان', 'قنبر', 'مدیر فروش', 'تامین کننده گازهای طبی', 'شرکت ها'),
  createData('بخش icu', 'ام کلثوم', 'مسوول بخش', '', 'درون سازمانی'),
  createData('شرکت اکسیژن هرمزگان', 'قنبر', 'مدیر فروش', 'تامین کننده گازهای طبی', 'شرکت ها'),
  createData('بخش icu', 'ام کلثوم', 'مسوول بخش', '', 'درون سازمانی'),
  createData('شرکت اکسیژن هرمزگان', 'قنبر', 'مدیر فروش', 'تامین کننده گازهای طبی', 'شرکت ها'),
  createData('بخش icu', 'ام کلثوم', 'مسوول بخش', '', 'درون سازمانی'),
  createData('شرکت اکسیژن هرمزگان', 'قنبر', 'مدیر فروش', 'تامین کننده گازهای طبی', 'شرکت ها'),
  createData('بخش icu', 'ام کلثوم', 'مسوول بخش', '', 'درون سازمانی'),
  createData('شرکت اکسیژن هرمزگان', 'قنبر', 'مدیر فروش', 'تامین کننده گازهای طبی', 'شرکت ها'),
  createData('بخش icu', 'ام کلثوم', 'مسوول بخش', '', 'درون سازمانی'),
  createData('شرکت اکسیژن هرمزگان', 'قنبر', 'مدیر فروش', 'تامین کننده گازهای طبی', 'شرکت ها'),
  createData('بخش icu', 'ام کلثوم', 'مسوول بخش', '', 'درون سازمانی'),
  createData('شرکت اکسیژن هرمزگان', 'قنبر', 'مدیر فروش', 'تامین کننده گازهای طبی', 'شرکت ها'),
  createData('بخش icu', 'ام کلثوم', 'مسوول بخش', '', 'درون سازمانی'),
  createData('شرکت اکسیژن هرمزگان', 'قنبر', 'مدیر فروش', 'تامین کننده گازهای طبی', 'شرکت ها'),
  createData('بخش icu', 'ام کلثوم', 'مسوول بخش', '', 'درون سازمانی'),
  createData('شرکت اکسیژن هرمزگان', 'قنبر', 'مدیر فروش', 'تامین کننده گازهای طبی', 'شرکت ها'),
  createData('بخش icu', 'ام کلثوم', 'مسوول بخش', '', 'درون سازمانی'),
  createData('شرکت اکسیژن هرمزگان', 'قنبر', 'مدیر فروش', 'تامین کننده گازهای طبی', 'شرکت ها'),
  createData('بخش icu', 'ام کلثوم', 'مسوول بخش', '', 'درون سازمانی'),
  createData('شرکت اکسیژن هرمزگان', 'قنبر', 'مدیر فروش', 'تامین کننده گازهای طبی', 'شرکت ها'),
  createData('بخش icu', 'ام کلثوم', 'مسوول بخش', '', 'درون سازمانی'),
  createData('شرکت اکسیژن هرمزگان', 'قنبر', 'مدیر فروش', 'تامین کننده گازهای طبی', 'شرکت ها'),
  createData('بخش icu', 'ام کلثوم', 'مسوول بخش', '', 'درون سازمانی'),
  createData('شرکت اکسیژن هرمزگان', 'قنبر', 'مدیر فروش', 'تامین کننده گازهای طبی', 'شرکت ها'),
  createData('بخش icu', 'ام کلثوم', 'مسوول بخش', '', 'درون سازمانی'),
  createData('شرکت اکسیژن هرمزگان', 'قنبر', 'مدیر فروش', 'تامین کننده گازهای طبی', 'شرکت ها'),
  createData('بخش icu', 'ام کلثوم', 'مسوول بخش', '', 'درون سازمانی'),
  createData('شرکت اکسیژن هرمزگان', 'قنبر', 'مدیر فروش', 'تامین کننده گازهای طبی', 'شرکت ها'),
  createData('بخش icu', 'ام کلثوم', 'مسوول بخش', '', 'درون سازمانی')
];

function App() {
  const columns = React.useMemo(
    () => [
      {
        Header: 'عنوان',
        accessor: 'onvan',
        style: {
          minWidth: 200
          //textAlign: 'center'
        }
      },
      {
        Header: 'نماینده',
        accessor: 'namayande'
      },
      {
        Header: 'سمت نماینده',
        accessor: 'semateNamayande'
      },
      {
        Header: 'زمینه فعالیت',
        accessor: 'zamineFaaliat'
      }
    ],
    []
  );

  const data = React.useMemo(() => getData(), []);

  return (
    <>
      <div
        style={{
          overflowX: 'scroll',
          minWidth: '100%',
          height: '83vh',
          whiteSpace: 'nowrap',
          padding: '1em'
        }}
      >
        <Table columns={columns} data={data} />
      </div>
    </>
  );
}

export default App;
